Autodesk.Revit.DB.Connector.PressureDrop
The pressure drop of the connector.
Remarks:
Instantaneous pressure drop of this connector, calculated according to system.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This connector does not support flow calculation and associated properties.

Autodesk.Revit.DB.Connector.Coefficient
The coefficient of the connector.
Remarks:
Instantaneous coefficient of this connector, calculated according to system.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This connector does not support flow calculation and associated properties.

Autodesk.Revit.DB.Connector.VelocityPressure
The velocity pressure of the connector.
Remarks:
Instantaneous velocity pressure of this connector,calculated according to system.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This connector does not support flow calculation and associated properties.

Autodesk.Revit.DB.Connector.Direction
The direction of the connector.
Remarks:
Instantaneous direction of this connector, calculated according to system.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This connector does not support flow calculation and associated properties.

Autodesk.Revit.DB.Connector.Flow
The flow of the connector.
Remarks:
Instantaneous flow at this connector, calculated according to system.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This connector does not support flow calculation and associated properties.

Autodesk.Revit.DB.Connector.GasketLength
Connector gasket length. When applicable, it represents the distance from the end of the fabrication part to the center of the gasket. Otherwise it returns zero.
Since:
2024

Autodesk.Revit.DB.Connector.EngagementLength
Connector engagement length. When applicable, it represents the inset distance to the end of the fabrication part from the connection point. Otherwise it returns zero.